Repository: vpendo/flask_app
Catalog: Group5_i18n/translations/*/LC_MESSAGES/messages.po
Languages: fr, rw, sw

source: About - AfricaLearn
fr: À propos - AfricaLearn
rw: Kuri - AfricaLearn
sw: Kuhusu - AfricaLearn

source: Home
fr: Accueil
rw: Ahabanza
sw: Nyumbani

source: Courses
fr: Cours
rw: Amasomo
sw: Kozi

source: About
fr: À propos
rw: Kuri
sw: Kuhusu

source: About AfricaLearn
fr: À propos d'AfricaLearn
rw: Kuri AfricaLearn
sw: Kuhusu AfricaLearn

source: Empowering language learners across Africa through innovative education
fr: Autonomiser les apprenants de langues à travers l'Afrique grâce à une éducation innovante
rw: Gufasha abanyeshuri b'ururimi muri Afurika binyuze mu masomo mashya
sw: Kuwawezesha wanafunzi wa lugha kote Afrika kupitia elimu ya kisasa

source: Our Story
fr: Notre Histoire
rw: Amateka Yacu
sw: Hadithi Yetu

source: Founded in 2024, AfricaLearn emerged from a vision to bridge language barriers across Africa. We believe that language learning should be accessible, engaging, and culturally relevant.
fr: Fondée en 2024, AfricaLearn est née d'une vision de combler les barrières linguistiques à travers l'Afrique. Nous croyons que l'apprentissage des langues devrait être accessible, engageant et culturellement pertinent.
rw: Yashinzwe mu 2024, AfricaLearn yavuye mu maso yo gufasha abantu muri Afurika gukoresha indimi. Dushishikariza ko kwiga indimi bigomba kuba byoroshye, byishimishije, kandi bikwiriye mu mico yacu.
sw: Iliyoundwa mwaka 2024, AfricaLearn ilitoka kwa maono ya kuvunja vizuizi vya lugha kote Afrika. Tunaamini kwamba kujifunza lugha kunapaswa kuwa rahisi, kuvutia, na kuhusiana na tamaduni.

source: Our Approach
fr: Notre Approche
rw: Uko Dukora
sw: Mbinu Yetu

source: We combine traditional teaching methods with modern technology to create an immersive learning experience. Our courses are designed by native speakers and language experts.
fr: Nous combinons les méthodes d'enseignement traditionnelles avec la technologie moderne pour créer une expérience d'apprentissage immersive. Nos cours sont conçus par des locuteurs natifs et des experts en langues.
rw: Dukora amasomo yacu dukoresheje uburyo bwa kera n'uburyo bwa kino. Amasomo yacu yateguwe n'abavugana n'ururimi rwabo n'ingenzi mu ndimi.
sw: Tunachanganya mbinu za kawaida za kufundisha na teknolojia ya kisasa ili kuunda uzoefu wa kujifunza wa kina. Kozi zetu zimetengenezwa na wazungumzaji wa asili na wataalamu wa lugha.

source: Our Impact
fr: Notre Impact
rw: Ingaruka Zacu
sw: Athari Yetu

source: Thousands of students have improved their language skills through our platform. We've helped professionals, students, and language enthusiasts achieve their goals.
fr: Des milliers d'étudiants ont amélioré leurs compétences linguistiques grâce à notre plateforme. Nous avons aidé des professionnels, des étudiants et des passionnés de langues à atteindre leurs objectifs.
rw: Amajana y'impuzamakungu y'abasomyi bafashe gukora neza indimi zabo binyuze kuri platform yacu. Twafashije abakora umwuga, abanyeshuri, n'abishimira indimi kugera ku ntego zabo.
sw: Maelfu ya wanafunzi wameboresha ujuzi wao wa lugha kupitia jukwaa letu. Tumewasaidia wataalamu, wanafunzi, na wapenzi wa lugha kufikia malengo yao.

source: Our Mission
fr: Notre Mission
rw: Intego Yacu
sw: Dhamira Yetu

source: To make language learning accessible to everyone in Africa, fostering cultural understanding and creating opportunities for personal and professional growth.
fr: Rendre l'apprentissage des langues accessible à tous en Afrique, favoriser la compréhension culturelle et créer des opportunités de croissance personnelle et professionnelle.
rw: Gufasha abantu bose muri Afurika kwiga indimi, gufasha gusobanukirwa amadini, no gufasha abantu gukora neza umwuga wabo.
sw: Kufanya kujifunza lugha kuwa rahisi kwa kila mtu barani Afrika, kukuza uelewa wa kitamaduni na kuunda fursa za ukuaji wa kibinafsi na kitaaluma.

source: Contact Us
fr: Contactez-nous
rw: Duhuza
sw: Wasiliana Nasi

source: Email: info@africalearn.com
sw: Barua pepe: info@africalearn.com

source: Phone: +250 788 123 456
fr: Téléphone : +250 788 123 456
rw: Telefoni: +250 788 123 456
sw: Simu: +250 788 123 456

source: Address: Kigali, Rwanda
fr: Adresse : Kigali, Rwanda
rw: Aderesi: Kigali, Rwanda
sw: Anwani: Kigali, Rwanda

source: Quick Links
fr: Liens Rapides
rw: Amahuza Yihuse
sw: Viungo vya Haraka

source: Follow Us
fr: Suivez-nous
rw: Dukurikire
sw: Tufuate

source: All rights reserved.
fr: Tous droits réservés.
rw: Uburenganzira bwose burafitwe.
sw: Haki zote zimehifadhiwa.

source: Courses - AfricaLearn
fr: Cours - AfricaLearn
rw: Amasomo - AfricaLearn
sw: Kozi - AfricaLearn

source: Our Language Courses
fr: Nos Cours de Langues
rw: Amasomo Yacu y'Indimi
sw: Kozi Zetu za Lugha

source: Choose from our wide range of language courses
fr: Choisissez parmi notre large gamme de cours de langues
rw: Hitamo mu masomo yacu y'indimi
sw: Chagua kutoka kwa anuwai ya kozi zetu za lugha

source: English Language
fr: Langue Anglaise
rw: Ururimi rw'Icyongereza
sw: Lugha ya Kiingereza

source: Master English with our comprehensive course
fr: Maîtrisez l'anglais avec notre cours complet
rw: Menya neza Icyongereza binyuze mu masomo yacu
sw: Jifunze Kiingereza kwa kina kupitia kozi yetu ya kina

source: Enroll Now
fr: S'inscrire Maintenant
rw: Iyandikishe Ubu
sw: Jisajili Sasa

source: French Language
fr: Langue Française
rw: Ururimi rw'Ikinyafuransa
sw: Lugha ya Kifaransa

source: Learn French from basic to advanced level
fr: Apprenez le français du niveau débutant au niveau avancé
rw: Jya kwiga Ikinyafuransa kuva ku ngingo za mbere kugeza ku ngingo z'ingenzi
sw: Jifunze Kifaransa kutoka kwa kiwango cha msingi hadi cha juu

source: Kinyarwanda Language
fr: Langue Kinyarwanda
rw: Ururimi rw'Ikinyarwanda
sw: Lugha ya Kinyarwanda

source: Discover the beauty of Kinyarwanda
fr: Découvrez la beauté du Kinyarwanda
rw: Menya ubwiza bw'Ikinyarwanda
sw: Gundua uzuri wa Kinyarwanda

source: Swahili Language
fr: Langue Swahili
rw: Ururimi rw'Ikiswahili
sw: Lugha ya Kiswahili

source: Learn Swahili for better communication
fr: Apprenez le Swahili pour une meilleure communication
rw: Jya kwiga Ikiswahili kugirango ube ufite ubwiza mu kuvugana
sw: Jifunze Kiswahili kwa mawasiliano bora

source: AfricaLearn - Language Learning Platform
fr: AfricaLearn - Plateforme d'Apprentissage des Langues
rw: AfricaLearn - Platform yo Kwiga Indimi
sw: AfricaLearn - Jukwaa la Kujifunza Lugha

source: Learn Languages with Confidence
fr: Apprenez les Langues avec Confiance
rw: Jya Kwiga Indimi Ufite Icyizere
sw: Jifunze Lugha kwa Ujasiri

source: Master new languages through interactive lessons and real-world practice
fr: Maîtrisez de nouvelles langues grâce à des leçons interactives et une pratique réelle
rw: Menya neza indimi nshya binyuze mu masomo y'ingenzi n'imyitozo y'ukuri
sw: Jifunze lugha mpya kupitia masomo ya kushirikiana na mazoezi ya ulimwengu wa kweli

source: Get Started
fr: Commencer
rw: Tangira
sw: Anza

source: Interactive Learning
fr: Apprentissage Interactif
rw: Kwiga Binyuze Mu Masomo Y'ingenzi
sw: Kujifunza kwa Kushirikiana

source: Engage with dynamic lessons and real-time feedback
fr: Participez à des leçons dynamiques avec des retours en temps réel
rw: Jya mu masomo y'ingenzi n'ubufasha bwa kare
sw: Shiriki katika masomo ya nguvu na maoni ya wakati halisi

source: Native Speakers
fr: Locuteurs Natifs
rw: Abavugana n'Ururimi Rwabo
sw: Wazungumzaji wa Asili
